var val = {
  "name" : "Акт первый. Действие первое.",
  "description" : "{ch1:description}",
  "steps" : [{
      "id" : 1,
      "text" : "Даю Вам слово чести мой дорогой племянник, что это последнее письмо которое Вы получите от меня. Я приложил немало усилий, чтобы пристроить вас в лоно Святой Церкви и считаю что полностью отдал Вам долг предписанный мне родственными узами и Вашим батюшкой, особенно если учесть что мне пришлось отдать все ваши карточные долги. Я несомненно считаю, что жизнь вдали от столицы и  работа  в следственном органе нашей Великой Церкви дисциплинирует Вас и быть может лишившись глупости и азарта вы станете достойным человеком. Постарайтесь не сгинуть в этом холодном краю мой дорогой племянник, хотя признаться честно - мне плевать.",
      "request" : [],
      "addafterstep" : [],
      "actions" : [{
          "id" : 1,
          "nextid" : 2,
          "action" : "",
          "text" : "Далее..."
        }
      ]
    }, {
      "id" : 2,
      "text" : "Пожирающий холод такой силы что перебивает чувство голода и страха, однообразная кладка мрачного монастыря и звук отъезжающего экипажа - кажется я запомню это надолго\r\n \r\n \r\n \r\n \r\n....сходил ли я в уборную?....",
      "request" : [],
      "addafterstep" : [],
      "actions" : [{
          "id" : 1,
          "nextid" : 3,
          "action" : "",
          "text" : "Войти в монастырь"
        }
      ]
    }, {
      "id" : 3,
      "text" : "Моё имя ****  я замещаю должность инквизитора, с этого момента вы в моем распоряжении, это бумага удостоверяет что предъявитель сего помощник инквизитора холодного утеса, с печатью Первосвященника - носи её всегда с собой. Без нее ты просто мальчишка в синей робе без навыков выживания в снежном краю. Твой кабинет сразу справа от моего, в здании на заднем дворе ты можешь найти ночлег. Тут есть столовая и библиотека вряд ли у тебя хватит времени даже на что-то одно. \r\nНа первом совещании я передам тебе дела от других помощников а пока в коридоре есть для тебя работенка. Это местный житель Оненга, кажется продавец вина, он пришел заявить о преступлении. Работай. \r\n\r\n\r\nСтол, три стула разной длины чернила и бумага, хотя бы сухо и тепло. \r\n",
      "request" : ["cd08700e-cd1a-4f36-859d-b36efcbc4963"],
      "addafterstep" : [],
      "actions" : [{
          "id" : 1,
          "nextid" : 4,
          "action" : "",
          "text" : "Позвать Оненгу"
        }
      ]
    }, {
      "id" : 4,
      "text" : "Толстый мужчина протискивается в дверь, у него на лице сменяют друг-друга страх и добродушная улыбка, с вашего позволения он присаживается на стул напротив вас. \r\n\r\n\r\nМеня зовут Оненнга и я торговец маслом! Я пришел чтобы сообщить о преступных действиях, но позвольте начну свой с самого начала, чтобы вы поняли всю суть происходящих событий…!!\r\n",
      "request" : [],
      "addafterstep" : [],
      "actions" : [{
          "id" : 1,
          "nextid" : 6,
          "action" : "",
          "text" : "Отлично, расскажите своими словами что произошло"
        }, {
          "id" : 2,
          "nextid" : 6,
          "action" : "",
          "text" : "Вы не на рынке а в кабинете инквизитора Святой церкви, отвечайте на вопросы и знайте что каждое ваше слово я протоколирую"
        }
      ]
    }, {
      "id" : 5,
      "text" : "",
      "request" : [],
      "addafterstep" : [],
      "actions" : [],
      "answers" : []
    }, {
      "id" : 6,
      "text" : " -я все понял прошу вас начинайте",
      "request" : [],
      "addafterstep" : [],
      "actions" : [{
          "id" : 1,
          "nextid" : 7,
          "action" : "",
          "text" : "Ваше имя, место жительства, род деятельности"
        }, {
          "id" : 2,
          "nextid" : 7,
          "action" : "",
          "text" : "Я хочу предупредить вас что если что-то из того что вы скажите не подтвердится я буду вынужден признать вас виновным в тяжком преступлении и выдать на суд светским властям."
        }
      ]
    }, {
      "id" : 7,
      "text" : "Мое имя Оннега, я торговец жиром и маслами, живу в квартале ремесленников Холодного утеса",
      "request" : [],
      "addafterstep" : [],
      "actions" : [{
          "id" : 1,
          "nextid" : 8,
          "action" : "",
          "text" : "на кого именно вы хотите заявить?"
        }
      ]
      
    }, {
      "id" : 8,
      "text" : "На своего соседа Жерену он постоянно подглядывает за моей женой, пристально смотрит за ней и ходит по пятам. думая что я не вижу.\r\n",
      "request" : [],
      "addafterstep" : [],
      "actions" : [{
          "id" : 1,
          "nextid" : 1,
          "action" : "",
          "text" : "“внести показания в протокол” \r\n\r\nИ что? Он совершает еще какие-то действия?"
        }, {
          "id" : 2,
          "nextid" : 10,
          "action" : "",
          "text" : "“не вносить показания в протокол” \r\n\r\nИ что? Он совершает еще какие-то действия?"
        }, {
          "id" : 3,
          "nextid" : 11,
          "action" : "",
          "text" : "“не вносить показания в протокол” \r\n\r\nТы с ума сошел? Мы расследуем только тяжкие преступления если тебе есть что сообщить об убийствах или ереси то говори или убирайся. "
        }
      ]
    }
  ],
  "chains" : [{
      "id" : 0,
      "name" : "{chp1_cn1}",
      "fStep" : 1
    }
  ],
  "objects" : [{
      "gid" : "cd08700e-cd1a-4f36-859d-b36efcbc4963",
      "name" : "Покакать",
      "type" : "-"
    }
  ]
}
